package com.example.lab_11;

import android.content.ContentValues;
import android.content.Context;
import android.database.Cursor;
import android.database.sqlite.SQLiteDatabase;
import android.database.sqlite.SQLiteOpenHelper;

import java.util.ArrayList;

import static com.example.lab_11.Constants.SinjajaSvita;
import static com.example.lab_11.Constants.ZalatyPtah;

public class DBHandler extends SQLiteOpenHelper {

    private static final String DB_NAME = "storiesdb";

    private static final int DB_VERSION = 1;

    private static final String TABLE_NAME = "stories";

    private static final String ID_COL = "id";

    private static final String STORYNAME_COL = "storyName";

    private static final String TEXT_COL = "text";

    private static final String NUMCHOICES_COL = "numChoices";

    private static final String CHOICE1_COL = "choice1";
    private static final String CHOICE2_COL = "choice2";
    private static final String CHOICE3_COL = "choice3";

    private static final String LINK1_COL = "link1";
    private static final String LINK2_COL = "link2";
    private static final String LINK3_COL = "link3";

    private static final String BACKGROUND_COL = "background";

    public DBHandler(Context context) {
        super(context, DB_NAME, null, DB_VERSION);

        if(checkDataBase()){
            addStories();
        }
    }

    @Override
    public void onCreate(SQLiteDatabase db) {
        String query = "CREATE TABLE " + TABLE_NAME + " ("
                + ID_COL + " INTEGER, "
                + STORYNAME_COL + " TEXT,"
                + TEXT_COL + " TEXT,"
                + NUMCHOICES_COL + " INTEGER,"
                + CHOICE1_COL + " INTEGER,"
                + CHOICE2_COL + " INTEGER,"
                + CHOICE3_COL + " INTEGER,"
                + LINK1_COL + " INTEGER,"
                + LINK2_COL + " INTEGER,"
                + LINK3_COL + " INTEGER,"
                + BACKGROUND_COL + " TEXT)";

        db.execSQL(query);
    }

    private boolean checkDataBase() {
        SQLiteDatabase db = this.getWritableDatabase();
        Cursor cursor = db.rawQuery("select count(*) from " + TABLE_NAME, null);
        cursor.moveToFirst();
        int count = cursor.getInt(0);
        return count == 0;
    }

    private void addStories(){
        addNewStory(0, ZalatyPtah,"Сардэчна запрашаем вас у падарожжа па сюжэце беларускай народнай казкі “Залаты птах”\n",
                1,"Пазнаёміцца з сынамі",null,null,
                1,-1,-1,"pic5");

        addNewStory(1,ZalatyPtah,"Былі ў аднаго чалавека тры сыны: два разумныя, а трэці — дурны.\nСтарэйшы сын, Сцяпан, умеў на скрыпцы іграць, сярэдні, Піліп,— на дудцы, а меншы, Іван, ні да чаго спрыту не меў: сядзеў у запечку ды лучынкі стругаў.\nВырасла ў таго чалавека ў садзе яблынька, а на ёй — залатыя яблыкі. Цешыцца бацька з яблыкаў, і сыны цешацца. Кожную раніцу ў сад ходзяць глядзець, ці цэлыя.\n",
                1,"Агледзець яблыньку",null,null,
                2,-1,-1,"pic5");

        addNewStory(2,ZalatyPtah,"Праверылі гэтак аднаго разу — не хапае яблыка! I на другую раніцу не далічыліся аднаго яблыка...\nЗасумаваў бацька. «Відаць,— думае,— нейкі злодзей панадзіўся ў сад цягацца». Кажа ён старэйшаму сыну, Сцяпану:\n— Ідзі ты, сынку, пільнаваць яблыкі. Прыставіў увечары Сцяпан да яблыні драбіны, залез на іх, сядзіць ды на скрыпцы іграе.\n",
                1,"Пайграць на скрыпцы",null,null,
                3,-1,-1,"pic5");

        addNewStory(3,ZalatyPtah,"Усю ноч іграў, а пад дзень дужа спаць захацелася,— ён і задрамаў. Раптам праз сон чуе: нешта над галавою моцна зашумела, залопала. Прахапіўся Сцяпан, працёр вочы,— нідзе нікога няма, толькі аднаго яблыка не хапае...",
                1,"Вярнуцца дадому",null,null,
                4,-1,-1,"pic5");

        addNewStory(4,ZalatyPtah,"Вярнуўся ён да бацькі маркотны.\n— Не ўпільнаваў,— кажа,— злодзея: зноў адзін яблык сарваў...\nНа другую ноч сярэдні сын, Піліп, кажа:\n— Пайду я пільнаваць. Быць таго не можа, каб не ўпільнаваў!\n",
                2,"Пайсці у сад пільнаваць злодзея ","Падмануць бацьку і братоў",null,
                5,7,-1,"pic8");

        addNewStory(5,ZalatyPtah,"Пайшоў ён, прымасціўся на драбінах ды выцінае сабе на дудцы розныя полечкі.",
                1,"Пайграць на дудцы",null,null,
                6,-1,-1,"pic8");

        addNewStory(6,ZalatyPtah,"Усю ноч іграў, а пад дзень дужа спаць захацелася,— ён і задрамаў. Раптам праз сон чуе: нешта над галавою моцна зашумела, залопала. Пакуль прачнуўся — зноў аднаго яблыка няма!",
                1,"Вярнуцца дадому",null,null,
                8,-1,-1,"pic8");

        addNewStory(7,ZalatyPtah,"Сказаў так Піліп, а сам думае:\n - Ага! Сцяпан не ўпільнаваў, а я буду час губляць! Лепш пайду ў карчму, пабаўлю часу крыху ды спаць потым лягу пад яблыняй.\nТак і прасядзеў у карчме Піліп ўсю ноч, выцінаў там на дудцы на ўсе лады, а пра абяцанне ўпільнаваць злодзея забыўся.\n",
                1,"Вярнуцца дадому",null,null,
                8,-1,-1,"pic8");

        addNewStory(8,ZalatyPtah,"Брыдка яму ў хату ісці, ды што зробіш: не дапільнаваў злодзея.\nНа трэці дзень меншы сын, Іван, кажа:\n— Дрэнныя з вас, браты, вартаўнікі. Вось я пайду, то на чым ні стане, а прыпільную злодзея.\nУсе толькі пасмяяліся з яго гаворкі: ат, вядома,— дурань!\n",
                1,"Набраць лучынак і пайсці на варту",null,null,
                9,-1,-1,"pic3");

        addNewStory(9,ZalatyPtah,"Набраў Іван цэлы жмут лучынак і пайшоў на варту. Сядзіць на драбінах, стружа лучынкі ды песенькі пад нос сабе мармыча.\nПачало на дзень займацца. Чуе Іван — нешта здалёку зашумела. Стаіўся ён, углядаецца. Аж бачыць — ляціць да яблыні вялікі залаты птах. Падляцеў блізка і хацеў яблык схапіць, а Іван злаўчыўся ды цап яго за доўгі хвост!\nВырваўся птах і паляцеў без яблыка. Глядзіць Іван, аж у яго руцэ тры залатыя пяры засталіся.\nПрыбег ён у хату, пабудзіў усіх.\n",
                1,"Паказаць пер’е братам і бацьку",null,null,
                10,-1,-1,"pic12");

        addNewStory(10,ZalatyPtah,"— Глядзіце,— кажа,— я злодзея дапільнаваў і тры залатыя пяры ў яго з хваста вырваў...\nПаглядзелі браты і пачырванелі ад сораму, што не яны, а дурань славы даказаў. Узяла іх зайздрасць.\n",
                2,"Першым знойдзе злодзея Сцяпан і Піліп","Першым знойдзе злодзея Іван",null,
                11,12,-1,"pic7");

        addNewStory(11,ZalatyPtah,"— Добра ж,— кажуць браты,— паедзем мы ў свет залатога птаха шукаць.\nНабралі яны ўсялякіх прыпасаў на дарогу ды паехалі.\nБлукалі браты па свеце, шукаючы злодзея, ды не ведалі дакладна, хто краў яблыкі.\nАднойчы трапілі яны ў лес дрымучы, стаміліся і селі адпачыць пад дрэвам. Ажно ўзняўся вецер магутны, сталі бегчы воблакі па небе. Напалохаліся браты і пабеглі з лесу. Выбеглі ў поле, там коні пасвяцца. Ускочылі браты на коней і панесліся па палявой дарозе. Азірнуліся назад, бачаць, што даганяюць іх слугі з каралеўскага двара. Не ўратаваліся браты. Трапілі ў палон.\n",
                1,"Вярнуцца ў пачатак",null,null,
                0,-1,-1,"pic11");

        addNewStory(12,ZalatyPtah,"— Добра ж,— кажа старэйшы брат,— паеду я ў свет залатога птаха шукаць.\nУзяў ён адно пяро для прыметы, набраў харчоў, грошай на дарогу ды паехаў.\nМінула, можа, з паўгода, а ні Сцяпана, ні птаха няма. Тады сярэдні брат кажа да бацькі:\n— Паеду хіба я шукаць залатога птаха. Можа, заадно і брата знайду.\nНабраў і ён усялякіх прыпасаў на дарогу ды паехаў.\nМінуў цэлы год, а ні братоў, ні птаха і слыхам не чуваць.\nБядуе бацька, а Іван стружа лучынкі ў запечку ды мармыча сабе пад нос:\n— Трэба, мусіць, мне самому ў дарогу выбірацца.\nПадумаў бацька: «Што ж, прапалі разумныя сыны, няхай і гэты, дурань, прападае». I не стаў яму пярэчыць.\n",
                2,"Выбрацца ў дарогу, узяць хлеба, ножык-сцізорык","Выбрацца ў дарогу",null,
                13,14,-1,"pic7");

        addNewStory(13,ZalatyPtah,"Выбраўся ў дарогу Іван, узяў трэцяе пяро, хлеба кавалак ды ножык-сцізорык, той, якім лучынкі стругаў. Узяўшы кій у рукі, пайшоў пехатою  залатога птаха шукаць.\nІдзе ён, ідзе, а ўжо і вечарэць пачынае. Чуе ён воўчы голас недалёка.",
                2,"Не збочваць з дарогі","Пайсці на голас",null,
                15,16,-1,"pic1");

        addNewStory(14,ZalatyPtah,"Нічога не ўзяў Іван з сабою: ні грошай, ні хлеба. Толькі ўзяў трэцяе пяро, кій у рукі і ножык-сцізорык, той, якім лучынкі стругаў. I пайшоў пехатою залатога птаха шукаць.\nІдзе ён, ідзе, а ўжо і вечарэць пачынае. Чуе ён воўчы голас недалёка.\n",
                2,"Не збочваць з дарогі","Пайсці на голас",null,
                15,16,-1,"pic1");

        addNewStory(15,ZalatyPtah,"Паспрабуйце зноў прайсці па дарозе ",
                1,"Прайсці яшчэ раз",null,null,
                12,-1,-1,"pic1");

        addNewStory(16,ZalatyPtah,"Пайшоў на той голас. Бачыць — сядзіць у глыбокай яме старая ваўчыха.\n— Ты чаго тут выеш? — пытаецца Іван у ваўчыхі.\n— Ды вось бяда якая,— адказвае ваўчыха,— бегла на паляванне, а трапіла ў яму...\nПамажы мне, добры чалавек, выбрацца адсюль. Я табе, чым хочаш, адплачу.\n",
                2,"Не згаджацца на дапамогу","Дапамагчы ваўчысе",null,
                17,18,-1,"pic1");

        addNewStory(17,ZalatyPtah,"Іван кажа:\n-\tВыбраўся я ў дарогу, каб залатога птаха знайсці, што ў бацькоўскім садзе залатыя яблыкі краў. Чым ты можаш дапамагчы мне, старая ты, бяссільная. Кінуў Іван ваўчысе кавалак хлеба, што з дому прыхапіў, ды і пайшоў далей па лесе.\nУ кожнай казцы ёсць падказка. Вярніцеся ў пачатак\n",
                1,"Вярнуцца",null,null,
                12,-1,-1,"pic1");

        addNewStory(18,ZalatyPtah,"Іван кажа:\n— Ты, старая ваўчыха, усюды гайсаеш, усюды бываеш: ці не скажаш мне, дзе жыве залаты птах? Калі скажаш, то вызвалю цябе з ямы.\n— I скажу табе і нават завяду да яго,— просіцца ваўчыха.\n— А не падманеш?\n— Не.\n— Ну, то глядзі.\nПрынёс Іван дзве жардзіны сукаватыя, апусціў у яму. Выскачыла ваўчыха па жэрдках наверх і кажа Івану:\n— Дзякую за ратунак. А цяпер сядай на мяне, я цябе хутчэй завязу туды, чым ты сам дойдзеш.\n",
                1,"Сесці на ваўчыху",null,null,
                19,-1,-1,"pic6");

        addNewStory(19,ZalatyPtah,"Сеў Іван на ваўчыху, тая і паджгала, не разбіраючы дарогі: па палях, па лясах, па балотных кустах. Іван толькі за вушы трымаецца, каб не скінуцца.\nПрымчалася ваўчыха да мора. Спынілася і кажа Івану:\n— Пасядзі тут крыху, а я пабягу дзе гуску пашукаю. Трэба табе добра падсілкавацца, каб дужы быў, бо вялікая работа цябе чакае.\nСеў Іван на беразе мора, пачаў на хвалі глядзець. Шумяць яны, гайдаюцца. Цікава!\n",
                2,"Паспаць","Не спаць",null,
                20,21,-1,"pic9");

        addNewStory(20,ZalatyPtah,"Глядзеў, глядзеў ды і заснуў. Ці доўга ён спаў, ці коратка, аж прыбягае ваўчыха з гускаю. Пабудзіла яго. Наклалі яны агню, спяклі гуску. Наеўся Іван.\n— Вось добра,— кажа,— і выспаўся і паабедаў. Цяпер ніякая дарога не страшная.\n— А зараз,— кажа ваўчыха,— сядай зноў на мяне. Паплывём за мора.\nПераплылі мора. Бачыць Іван — стаіць на беразе мора залаты палац. Ваўчыха кажа:\n— Ідзі ў гэты палац. Толькі паціхусеньку, памалюсеньку, каб нідзе і не шархнуў, бо гэта зачараваны палац: усё ў ім спіць. Але калі ты неасцярожна дакранешся да чаго, то ўсё абудзіцца, і тады жывым табе адтуль не выбрацца. Як увойдзеш у браму, убачыш там двух сабак. Яны на жалезных ланцугах да слупоў прыкуты. Глядзі ж, не пабудзі іх, бо як забрэшуць яны, то ўвесь палац на ногі ўзнімуць. Мінеш гэтак браму, увойдзеш у першы пакой. Там вісіць меч бразгучы. Ён залаты, дарагімі камянямі аздоблены. Але ты яго не чапай, бо ён пачне бразджаць і ўсіх пабудзіць. Увойдзеш у другі пакой, там вісіць гадзіннік пявучы, і яго не чапай, а ідзі проста ў трэці пакой: у ім убачыш залатую клетку, а ў той клетцы і сядзіць залаты птах. Вымі яго асцярожна з клеткі і сам варочайся да мяне.\n",
                1,"Зайсці ў палац, агледзецца",null,null,
                22,-1,-1,"pic9");

        addNewStory(21,ZalatyPtah,"Глядзіць на мора Іван і думае пра родны дом, пра бацьку. Узгадаў братоў сваіх старэйшых Сцяпана ды Піліпа. Адчула сэрца, што ў бядзе браты. Засумаваў хлопец, пакаціліся слёзы з вачэй, агарнуў жаль Івана, што не змог адразу злавіць залатога птаха, упільнаваць яблыкі. Аж бачыць, што бяжыць ваўчыха з гускаю. Змахнуў Іван слёзы з вачэй і гаворыць:\n-\tВось і добра! Падсілкуемся і выправімся далей у дарогу. \nНаклалі яны агню, спяклі гуску. Наеўся Іван.\n",
                1,"Зайсці ў палац, агледзецца",null,null,
                22,-1,-1,"pic9");

        addNewStory(22,ZalatyPtah,"Пайшоў Іван у зачараваны палац. Мінуў браму з сабакамі, увайшоў у першы пакой, у другі. Бачыць — розных майстроў тут безліч: і сталяры, і слесары, і муляры. А каля іх варта з шаблямі ды стрэльбамі. I дзе хто што рабіў, там і заснуў. Падзівіўся Іван на іх ды пайшоў далей, у трэці пакой.\nВось перад ім і залатая клетка вісіць, а ў ёй залаты птах сядзіць. Як убачыў Іван птаха-злодзея, дык і на перасцярогу забыўся.\n",
                1,"Схапіць клетку",null,null,
                23,-1,-1,"pic11");

        addNewStory(23,ZalatyPtah,"Схапіў клетку, сарваў са сцяны. I тут такі звон пайшоў... Напалохаўся Іван ды назад. У другім пакоі зачапіўся знячэўку за залаты гадзіннік. Той давай спяваць, на ўсе лады выцінаць. Пабег Іван далей. Ускочыў у першы пакой, схапіў меч — вельмі ж ён прыгожы быў! А меч як забразджыць... Усё ў зачараваным палацы абудзілася. Усе кінуліся за Іванам.",
                1,"Прабегчы стралой ды выскачыць з палаца",null,null,
                24,-1,-1,"pic4");

        addNewStory(24,ZalatyPtah,"Ды Іван не драмаў — як страла праляцеў каля сабак і выскачыў з палаца.\nБачыць ваўчыха — бяда: Іван імчыцца на ўвесь дух, а за ім цэлая пагоня. Падскочыла да яго ваўчыха.\n",
                1,"Пагоня злавіла Івана",null,null,
                25,-1,-1,"pic4");

        addNewStory(25,ZalatyPtah,"Сядзіць Іван у астрозе ды думае: як жа выбрацца?\nУспомніў ён, што, выбіраючыся ў дарогу, узяў ножык-сцізорык. Дастаў ён яго з кішэні і кажа вартаўніку:\n       - Ёсць у вашым палацы шмат рэчаў цудадзейных: і меч бразгучы, і гадзіннік залаты, а чароўнага ножыка-сцізорыка няма. \n      Спадабаўся вартаўніку ножык, увайшоў ён у астрог, каб бліжэй разгледзець, а Іван злаўчыўся ды і выскачыў, зачыніў дзверы. Бяжыць па палацы ў пакой, дзе залатую клетку з птахам бачыў. Схапіў ён клетку залатую ды імчыцца на ўвесь дух. Тут і ваўчыха падскочыла.\n— Сядай,— кажа,— на мяне хутчэй! Сеў Іван, а ваўчыха — у мора і паплыла. Пераплыў Іван мора і просіць ваўчыху:\n— Скажы, дзе мае браты. Я не магу без іх дадому вярнуцца.\n— Эх,— уздыхнула ваўчыха,— не шукай ты лепш братоў, бо яны цябе са свету звядуць.\n— Не звядуць,— адказвае Іван.\n— Ну, калі ты такі смелы, то ідзі на каралеўскі двор,— там твае браты ў астрозе сядзяць. Толькі глядзі, сцеражыся іх... Яны табе дабра не жадаюць.\n",
                2,"Паслухаць ваўчыху і падацца дадому","Развітацца з ваўчыхай і падацца на каралеўскі двор",null,
                26,27,-1,"pic6");

        addNewStory(26,ZalatyPtah,"Зрэшты, нельга пакінуць братоў у бядзе.",
                1,"Вярніцеся ў палац",null,null,
                22,-1,-1,"pic11");

        addNewStory(27,ZalatyPtah,"Развітаўся Іван з ваўчыхай, падзякаваў ёй і падаўся на каралеўскі двор. Прыйшоў да караля, прывітаўся.\n— Што скажаш? — пытаецца кароль.\n— Выпусці маіх братоў,— кажа Іван — Навошта ты іх у астрозе трымаеш?\nКароль кажа:\n— Не выпушчу. Твае браты хацелі лепшых маіх коней пакрасці.\nІван і так і сяк просіць — не згаджаецца кароль.\n— Дык я выкуплю іх.\n— Чым жа ты выкупіш?\nДастаў Іван з-пад світкі залаты меч:\n— Вось табе выкуп.\nПаглядзеў кароль на меч — спадабаўся: такога ў яго няма!\n— Ну, добра,— згадзіўся кароль,— забірай сваіх братоў. Толькі больш не пускай іх у маё каралеўства.\nЗабраў Іван братоў, расказаў ім, як дастаў залатога птаха, і пайшлі ўсе разам дахаты.\n",
                2,"Трапіў Іван у цёмным лесе ў яму","Ад зайздрасці браты забілі Івана",null,
                28,29,-1,"pic10");

        addNewStory(28,ZalatyPtah,"Прыйшлі яны ў цёмны лес. Ідуць, размаўляюць аб тым, як залатога птаха шукалі. І раптам ступае Іван, а ступіць няма на што. Праваліўся ў глыбокую яміну, выцяўся аб камень галавой і апрытомнеў. Браты спалохаліся, схапілі залатога птаха ды і пабеглі дамоў.\nШмат часу мінула ці не, здарылася трапіць у той лес ваўчысе. Чуе яна — дзесьці чалавек блізка. Пабегла ў той бок і ўбачыла апрытомненага Івана ў яміне.\n— Вось,— бядуе ваўчыха,— як ты мяне паслухаў! А я ж табе казала, я ж цябе навучала: асцерагайся ліхіх братоў!\nПабегла ваўчыха на высокую гару, дастала пляшачку жывой вады. Вярнулася і ажывіла Івана. Устаў ён, пацягнуўся:\n— Ох, як жа я доўга спаў!\n— Спаць бы табе тут век-векам, каб не я,— кажа ваўчыха.\n— А дзе ж мае браты? — пытаецца Іван.\n— Дома. Спяшайся хутчэй і ты дадому. Там твой бацька з радасці, што браты вярнуліся і залатога птаха прынеслі, бяседу ладзіць. З'язджаюцца да яго нават паны і каралі на дзіва глядзець. Але бацька цяпер цябе не пазнае, бо ты змяніўся ад жывой вады. Дык ты, як прыйдзеш дахаты, папрасіся да кухара за памочніка. А як зварыцца страва, то ўпусці ў яе па кропельцы жывой вады.\nНавучыла ваўчыха Івана, што яму рабіць, і пабегла.\nВярнуўся Іван дадому. А там і праўда госці збіраюцца. Кухар аж разрываецца адзін — шмат розных страў трэба наварыць ды напячы для гасцей. Падышоў Іван да кухара:\n— Давай я табе памагаць буду.\n— Добра,— згадзіўся кухар,— памагай, бо мне аднаму не ўправіцца.\nУзяўся Іван памагаць. А потым і кажа кухару:\n— Ты, дзядзька, стары, змарыўся, адпачні, а я ўжо сам усё скончу.\nБачыць кухар, што памочнік яго добра стараецца, і лёг адпачыць.\nЗгатаваў Іван абед, уліў у кожную страву па кроплі жывой вады і пабудзіў кухара. Той панёс абед да сталоў.\nБяседнікі ядуць і стравы хваляць — вельмі ж усё смачна згатавана!\nПасля абеду кліча гаспадар кухара, дае яму гасцінца і дзякуе за смачныя стравы. Кухар кажа:\n— Гэта ж тут адзін хлопец у мяне за памочніка быў, дык ён і наварыў такіх смачных страў. Сам я гатаваць гэтак не ўмею.\nГаспадар кажа:\n— Дык пакліч яго да мяне, трэба і яму падзякаваць.\nПаклікалі Івана. Гаспадар пытаецца:\n— Дзе ты навучыўся такія смачныя стравы варыць?\n— Бяда ўсяму навучыць,— адказвае Іван.\n— Якая ж у цябе, хлопча, бяда?\n Іван і расказаў пра тое, як ён залатога птаха дастаў, як братоў у караля выкупіў і як у яму трапіў, а добрая ваўчыха выратавала.\nДоўга злаваўся бацька і крычаў на старэйшых сыноў, але Іван уступіўся за іх, бо сам у яміну трапіў. Браты апамяталіся, сталі прабачэння прасіць, што не ўратавалі Івана, што скралі залатога птаха.\nА бацька падумаў і сказаў, што малодшы сын разумнейшы за ўсіх аказаўся.  \n",
                1,"Канец",null,null,
                30,-1,-1,"pic6");

        addNewStory(29,ZalatyPtah,"Прыйшлі яны ў цёмны лес, браты забілі Івана, а самі забралі залатога птаха ды пабеглі дамоў.\nШмат часу мінула ці не, здарылася трапіць у той лес ваўчысе. Чуе яна — дзесьці чалавек блізка. Пабегла ў той бок і ўбачыла забітага Івана.\n— Вось,— бядуе ваўчыха,— як ты мяне паслухаў! А я ж табе казала, я ж цябе навучала: асцерагайся ліхіх братоў!\nПабегла ваўчыха на высокую гару, дастала пляшачку жывой вады. Вярнулася і ажывіла Івана. Устаў ён, пацягнуўся:\n— Ох, як жа я доўга спаў!\n— Спаць бы табе тут век-векам, каб не я,— кажа ваўчыха.\n— А дзе ж мае браты? — пытаецца Іван.\n— Дома. Спяшайся хутчэй і ты дадому. Там твой бацька з радасці, што браты вярнуліся і залатога птаха прынеслі, бяседу ладзіць. З'язджаюцца да яго нават паны і каралі на дзіва глядзець. Але бацька цяпер цябе не пазнае, бо ты змяніўся ад жывой вады. Дык ты, як прыйдзеш дахаты, папрасіся да кухара за памочніка. А як зварыцца страва, то ўпусці ў яе па кропельцы жывой вады.\nНавучыла ваўчыха Івана, што яму рабіць, і пабегла.\nВярнуўся Іван дадому. А там і праўда госці збіраюцца. Кухар аж разрываецца адзін — шмат розных страў трэба наварыць ды напячы для гасцей. Падышоў Іван да кухара:\n— Давай я табе памагаць буду.\n— Добра,— згадзіўся кухар,— памагай, бо мне аднаму не ўправіцца.\nУзяўся Іван памагаць. А потым і кажа кухару:\n— Ты, дзядзька, стары, змарыўся, адпачні, а я ўжо сам усё скончу.\nБачыць кухар, што памочнік яго добра стараецца, і лёг адпачыць.\nЗгатаваў Іван абед, уліў у кожную страву па кроплі жывой вады і пабудзіў кухара. Той панёс абед да сталоў.\nБяседнікі ядуць і стравы хваляць — вельмі ж усё смачна згатавана!\nПасля абеду кліча гаспадар кухара, дае яму гасцінца і дзякуе за смачныя стравы. Кухар кажа:\n— Гэта ж тут адзін хлопец у мяне за памочніка быў, дык ён і наварыў такіх смачных страў. Сам я гатаваць гэтак не ўмею.\nГаспадар кажа:\n— Дык пакліч яго да мяне, трэба і яму падзякаваць.\nПаклікалі Івана. Гаспадар пытаецца:\n— Дзе ты навучыўся такія смачныя стравы варыць?\n— Бяда ўсяму навучыць,— адказвае Іван.\n— Якая ж у цябе, хлопча, бяда?\nІван і расказаў пра тое, як ён залатога птаха дастаў, як братоў у караля выкупіў і як яны яго забілі, а добрая ваўчыха ажывіла...\nСтаяць браты моўчкі, белыя як палатно, а бацька пытаецца:\n— Дык гэта ж ты, мусіць, мой меншы сын Іван?\n— Але,— кажа Іван.— Я птаха дастаў і слова стрымаў, а яны — браты мае разумныя — ліхадзеі!\nВыгнаў бацька старэйшых сыноў з дому, а з Іванам і цяпер жыве.\n",
                1,"Канец",null,null,
                30,-1,-1,"pic2");

        addNewStory(30,ZalatyPtah,"Канец",
                1,"У пачатак",null,null,
                31,-1,-1,"pic7");



        addNewStory(0,SinjajaSvita,"Вітаем вас у свеце гульні “Сіняя світа налева пашыта”!”\n",
                1,"Пачаць знаемства з казкай",null,null,
                1,-1,-1,"pic5");

        addNewStory(1,SinjajaSvita,"Жыў-быў цар-чараўнік. Клікнуў ён кліч па ўсім царстве: «Хто схаваецца ад мяне, таму паўцарства аддаю!»\nЗнайшоўся такі ахвотнік — Сіняя світа налева пашыта. Прыходзіць ён да цара-чараўніка.\n— Я, — кажа, — бяруся схавацца так, што ты мяне не знойдзеш.\n— Добра, — кажа цар. — Калі схаваешся — паўцарства табе, а не — галава з плеч. Распішыся.\nРаспісаўся Сіняя світа і давай хавацца. Перад царом стаяў добрым малайцом, па двары бег чорным сабалём, пад вароты лез белым гарнастаем, па полі бег шэрым зайцам.\n",
                2,"Пабегчы ў трыдзявятае царства.","Пабегчы ў трыдзясятае царства.",null,
                2,5,-1,"pic5");

        addNewStory(2,SinjajaSvita,"Як бегчы, дык бегчы — забег у трыдзявятае царства. \nА ў тым царстве быў дужа вялікі луг. Прыбег ён на той луг.\n",
                2,"Перакінуцца ў тры кветкі.","Перакінуцца ў перапёлку.",null,
                3,4,-1,"pic5");

        addNewStory(3,SinjajaSvita,"На другі дзень цар устаў, паглядзеў у сваю чараўнічую кнігу і кажа:\n— Перада мною стаяў добрым малайцом, па двары бег чорным сабалём, пад вароты лез белым гарнастаем, па полі бег шэрым зайцам. Забег на вялікі луг у трыдзявятае царства і перакінуўся ў тры кветкі розных колераў.\nПаклікаў цар слуг і загадаў ім схадзіць у тое царства і прынесці з вялікага лугу тры кветкі розных колераў.\nПайшлі слугі. Доўга ішлі ці нядоўга, але дайшлі да вялікага лугу, сарвалі тры кветкі, загарнулі ў хустачку і прынеслі цару.\nЦар разгарнуў хустачку і смяецца:\n— А што, Сіняя світа, ці схаваўся ты ад мяне?\nСіняя світа перакінуўся ў чалавека і кажа:\n— Дазволь, цар, схавацца яшчэ раз.\nЦар дазволіў.\n",
                1,"Вярнуцца да пачатку.",null,null,
                1,-1,-1,"pic8");

        addNewStory(4,SinjajaSvita,"Перакінуцца ў перапёлку.",
                1,"Вярнуцца да пачатку.",null,null,
                1,-1,-1,"pic5");

        addNewStory(5,SinjajaSvita,"Сіняя світа налева пашыта перад царом стаяў добрым малайцом, па двары бег чорным сабалём, пад вароты лез белым гарнастаем, па полі бег шэрым зайцам. Як бегчы, дык бегчы — забег за трыдзевяць зямель, у трыдзясятае царства. І бачыць:  налева ёсць такое балота, што зверху мох, а пад нізам возера. Направа расце такі дуб, што карэнні ў зямлі, а вяршыня ў небе.",
                2,"Схавацца ў балоце.","Схавацца на дубе.",null,
                6,9,-1,"pic8");

        addNewStory(6,SinjajaSvita,"Зайшоў ён у мох.",
                2,"Перакінуцца ў рыбу-акуня.","Перакінуцца ў смаўжа.",null,
                7,8,-1,"pic8");

        addNewStory(7,SinjajaSvita,"Перакінуўся ў рыбу-акуня, забраўся на самае дно возера і сядзіць там.\nРаніцай цар устаў, паглядзеў у сваю чараўнічую кнігу і кажа:\n— Перада мною стаяў добрым малайцом, па двары бег чорным сабалём, пад вароты лез белым гарнастаем, па полі бег шэрым зайцам. Забег за трыдзевяць зямель, у трыдзесятае царства, перакінуўся ў рыбу-акуня і схаваўся ў мохавым балоце!\nЗагадаў цар сваім слугам ісці ў трыдзесятае царства ачысціць мохавае балота і злавіць там акуня.\nСлугі так і зрабілі: ачысцілі балота, закінулі невады і злавілі акуня. Загарнулі яго ў хустачку, прынеслі цару.\n— Ну што, Сіняя світа налева пашыта, ці схаваўся ты ад мяне і другі раз? — смяецца цар.\nСіняя світа перакінуўся ў чалавека і кажа:\n— Дазволь, цар, схавацца яшчэ раз.\nЦар дазволіў.\n",
                1,"Вярніся да пачатку",null,null,
                1,-1,-1,"pic8");

        addNewStory(8,SinjajaSvita,"Перакінуцца ў смаўжа.\n",
                1,"Вярніся да пачатку",null,null,
                1,-1,-1,"pic3");

        addNewStory(9,SinjajaSvita,"Узлез ён на дуб, перакінуўся ў іголку, зашыўся пад кару і сядзіць там. Прыляцела на дуб птушка Нагай, пачула нюхам, што пад карою чалавек сядзіць, ды пытаецца:\n— Хто тут?\n",
                2,"Стаіцца і не адказваць.", "Загаварыць з птушкай.",null,
                10,11,-1,"pic12");

        addNewStory(10,SinjajaSvita,"Ничога не адказаў Сіняя світа.\nРаніцай цар устаў, памыўся, паглядзеў у чараўнічую кнігу і кажа:\n— Перада мною стаяў добрым малайцом, па двары бег чорным сабалём, пад вароты лез белым гарнастаем, па полі бег шэрым зайцам, забег у трыдзесятае царства. Ёсць там дуб, што карэнні ў зямлі, а вяршыня ў небе. Забраўся ён пад яго кару і сядзіць там, перакінуўшыся ў іголку.\nЗагадаў цар слугам спілаваць дуб, пакалоць на дровы і спаліць. І згінуў Сіняя світа.\n",
                1,"Вярнуцца ў пачатак", null,null,
                1,-1,-1,"pic11");

        addNewStory(11,SinjajaSvita,"— Я, — кажа Сіняя світа.\n— А чаго ты сюды залез?\n— Ды вось узяўся я ад цара-чараўніка схавацца, а ніяк не ўдаецца.\n— Хочаш, я цябе схаваю.\n— Схавай, добрая птушка. Век буду табе дзякаваць.\nПтушка Нагай перакінула яго ў пярынку, узяла пад крыло, занесла ў царскі палац і палажыла соннаму цару за пазуху.\nРаніцай цар устаў, памыўся, паглядзеў у чараўнічую кнігу і кажа:\n— Перада мною стаяў добрым малайцом, па двары бег чорным сабалём, пад вароты лез белым гарнастаем, па полі бег шэрым зайцам, забег у трыдзесятае царства. Ёсць там дуб, што карэнні ў зямлі, а вяршыня ў небе. Забраўся ён пад яго кару і сядзіць там, перакінуўшыся ў іголку.\nЗагадаў цар слугам спілаваць дуб, пакалоць на дровы і спаліць.\nСлугі так і зрабілі, а Сіняй світы не знайшлі. Прыходзяць і кажуць цару:\n— Няма Сіняй світы.\n— Як няма? — усхадзіўся цар. — Не можа гэтага быць!\n— Няма, і ўсё, — кажуць слугі.\nВыйшаў цар на ганак, пачаў клікаць:\n— Сіняя світа налева пашыта, пакажыся!\n",
                2,"Паказацца.", "Паставіць умову.",null,
                12,13,-1,"pic7");

        addNewStory(12,SinjajaSvita,"З-за пазухі цара вылецела лёгкая пярынка і стала добрым малайцом.\n— Вось і я! — кажа Сіняя світа.\nПашкадаваў цар, што паабяцаў Сіняй свіце паўцарства, і адказвае:\n-\tНічога я не абяцаў табе, а хацеў выпрабаваць сваю чарадзейную сілу!\nПаклікаў цар сваіх слуг, і яны выгналі Сінюю світу з палаца.\n",
                1,"Вярнуцца ў трыдзясятае царства.", null,null,
                5,-1,-1,"pic1");

        addNewStory(13,SinjajaSvita,"— Збяры, — адказвае Сіняя світа, — сваіх генералаў, тады пакажуся.\nЦар чуе голас Сіняй світы, а не ведае, адкуль ідзе той голас. Круціўся ён, круціўся, усюды заглядваў, а Сіняя світа як вадой разліўся.\nНу, рабіць няма чаго, сабраў цар сваіх генералаў. Выйшаў на ганак і зноў кліча:\n— Сіняя світа, пакажыся!\n— Не, — чуе голас Сіняй світы, — спярша пры генералах адпішы мне палавіну царства, тады пакажуся. Бо ты падманеш — я цябе ведаю!\nЯк ні не хацелася цару, а прыйшлося аддаць палавіну царства. Толькі паставіў ён пры генералах на ўказе сваю царскую пячатку, як з-за пазухі яго вылецела лёгкая пярынка і стала добрым малайцом.\n— Вось і я! — кажа Сіняя світа.\nСхапіў ён той указ — ды сабе ў кішэнь.\nПерастаў тады цар-чараўнік хованкамі займацца.\n",
                1,"Канец", null,null,
                14,-1,-1,"pic1");

        addNewStory(14,SinjajaSvita,"Канец",
                1,"У пачатак",null,null,
                15,-1,-1,"pic1");
    }

    public ArrayList<StageClass> getStory(String story) {
        ArrayList<StageClass> arr = new ArrayList<StageClass>();

        SQLiteDatabase db = this.getReadableDatabase();
        //Cursor res =  db.rawQuery( "select * from " + TABLE_NAME + " where " + STORYNAME_COL + " = " + story, null );
        Cursor res =  db.rawQuery( "select * from " + TABLE_NAME, null );
        res.moveToFirst();

        while(res.isAfterLast() == false){
            StageClass sc = getStageClass(res,story);
            if(sc != null){
                arr.add(sc);
            }
            res.moveToNext();
        }
        return arr;
    }

    StageClass getStageClass(Cursor cursor, String story)
    {
        try
        {
            int storyNameIndex = cursor.getColumnIndexOrThrow(STORYNAME_COL);
            String storyName = cursor.getString(storyNameIndex);
            if(!storyName.equals(story)){
                return null;
            }
            StageClass sc = new StageClass();
            int idIndex = cursor.getColumnIndexOrThrow(ID_COL);
            int textIndex = cursor.getColumnIndexOrThrow(TEXT_COL);
            int numChoicesIndex = cursor.getColumnIndexOrThrow(NUMCHOICES_COL);
            int choice1Index = cursor.getColumnIndexOrThrow(CHOICE1_COL);
            int choice2Index = cursor.getColumnIndexOrThrow(CHOICE2_COL);
            int choice3Index = cursor.getColumnIndexOrThrow(CHOICE3_COL);
            int link1Index = cursor.getColumnIndexOrThrow(LINK1_COL);
            int link2Index = cursor.getColumnIndexOrThrow(LINK2_COL);
            int link3Index = cursor.getColumnIndexOrThrow(LINK3_COL);
            int backgroundIndex = cursor.getColumnIndexOrThrow(BACKGROUND_COL);

            sc.setID(cursor.getInt(idIndex));
            sc.setText(cursor.getString(textIndex));
            sc.setNumChoices(cursor.getInt(numChoicesIndex));
            sc.setChoice(cursor.getString(choice1Index),0);
            sc.setChoice(cursor.getString(choice2Index),1);
            sc.setChoice(cursor.getString(choice3Index),2);
            sc.setLink(cursor.getInt(link1Index),0);
            sc.setLink(cursor.getInt(link2Index),1);
            sc.setLink(cursor.getInt(link3Index),2);
            sc.setImage(cursor.getString(backgroundIndex));

            return sc;
        }
        catch (Exception e)
        {
            e.printStackTrace();
        }
        return null;
    }

    public void addNewStory(int id, String storyName, String text, int numChoices, String choice1, String choice2,
                            String choice3, int link1, int link2, int link3,
                            String background) {
        SQLiteDatabase db = this.getWritableDatabase();

        ContentValues values = new ContentValues();

        values.put(ID_COL, id);
        values.put(STORYNAME_COL, storyName);
        values.put(TEXT_COL, text);
        values.put(NUMCHOICES_COL, numChoices);
        values.put(CHOICE1_COL, choice1);
        values.put(CHOICE2_COL, choice2);
        values.put(CHOICE3_COL, choice3);
        values.put(LINK1_COL, link1);
        values.put(LINK2_COL, link2 < 0 ? null : link2);
        values.put(LINK3_COL, link3 < 0 ? null : link3);
        values.put(BACKGROUND_COL, background);

        db.insert(TABLE_NAME, null, values);

        db.close();
    }

    @Override
    public void onUpgrade(SQLiteDatabase db, int oldVersion, int newVersion) {

    }
}
